lib/tasks/continents.rake

DELETE FROM "continents" WHERE "continents"."id" = ?  [["id", 1]]
INSERT INTO "continents" ("Continent", "Country", "Population", "Population_density", "Urban_population", "Urban_population_coastal", "GDP_per_capita", "Land_area", "Cropland_area", "Pasture_area", "Water_per_capita", "Commercial_energy_consumption", "Traditional_fuel_consumption", "Commercial_hydroelectric_consumption", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  task seed_continents: :environment do

    #drop the old table data before importing the new stuff
    Continent.destroy_all
    Emission.destroy_all

    CSV.foreach("lib/assets/Socio-Economic_Baseline_Data.csv", :headers =>false) do |row|
      puts row.inspect #just so that we know the file's being read

      #create new model instances with the data
      Continent.create!(
      Continent: row[0],
      Country: row[1].to_s,
      Population: row[2].to_i,
      Population_density: row[3].to_i,
      Urban_population: row[5].to_i,
      Urban_population_coastal: row[6].to_i,
      GDP_per_capita: row[7].to_i,
      Land_area: row[12].to_i,
      Cropland_area: row[13].to_i,
      Pasture_area: row[14].to_i,
      Water_per_capita: row[17].to_i,
      Commercial_energy_consumption: row[31].to_i,
      Traditional_fuel_consumption: row[32].to_i,
      Commercial_hydroelectric_consumption: row[33].to_i
    )