app/views/continents/show.html.erb

SELECT  "continents".* FROM "continents" WHERE "continents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Continent:</strong>
  <%= @continent.country.continent %>