app/controllers/continents_controller.rb

SELECT "continents".* FROM "continents" WHERE (country LIKE '%Algeria%')
SELECT "continents".* FROM "continents"
---
  def index
    @continents = if params[:term]
      Continent.where('country LIKE ?',"%#{params[:term]}%")
    else
      Continent.all

SELECT  "continents".* FROM "continents" WHERE "continents"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_continent
      @continent = Continent.find(params[:id])